app/views/inscricao_liderancas/_form_correcao.html.erb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <% if !@inscricao_lideranca.usuario_corrigiu_entrevista.nil? %>
    <% usuario = Usuario.find(@inscricao_lideranca.usuario_corrigiu_entrevista) %>

SELECT "cargos".* FROM "cargos" WHERE "cargos"."deleted_at" IS NULL
---
      <%= form.label :cargo_id, class: 'required' %>
      <%= form.collection_select :cargo_id, Cargo.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', disabled: true %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_01_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_02_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_03_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_04_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_05_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_01_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_02_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_03_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>