app/views/inscricao_liderancas/_form.html.erb

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
<%= form_with(model: inscricao_lideranca, local: true, html: { multipart: true }) do |form| %>
  <% configuracao = Configuracao.where(status: true).last %>

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "c4ca4238a0b923820dcc509a6f75849b_teste"], ["LIMIT", 1]]
---
  <% if(!params[:id].nil?) %>
    <% inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id]) %>

SELECT "cargos".* FROM "cargos" WHERE "cargos"."deleted_at" IS NULL AND "cargos"."tipo_cargo" = $1  [["tipo_cargo", "Liderança"]]
---
        <%= form.label :cargo_id, class: 'required' %>
        <%= form.collection_select :cargo_id, Cargo.where(tipo_cargo:"Liderança"), :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', required: true %>

SELECT "local_contratacaos".* FROM "local_contratacaos"
---
          <div class="col-md-6">
            <%= f.collection_select :local_contratacao_id, LocalContratacao.all, :id, :descricao, {include_blank: '--Selecione uma região--'}, class: 'form-control', required: true %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
    <br>
    <% configuracao = Configuracao.where(status: true).last %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
              <!--ABRIR RECURSO DA CONFERÊNCIA DOS DADOS-->
              <% configuracao = Configuracao.where(status: true).last %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
            <!--ABRIR RECURSO DA CONFERÊNCIA DOS DADOS-->
            <% configuracao = Configuracao.where(status: true).last %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
            <!-- ABRIR RECURSO DA PONTUAÇÃO -->
            <% configuracao = Configuracao.where(status: true).last %>

SELECT "local_contratacaos".* FROM "local_contratacaos"
---
// REGRA PARA LIMITAR A QUANTIDADE DE REGIÃO QUE PODE CONCORRER PARA O CARGO
<% quantidade_regioes_cadastradas = LocalContratacao.all.length %>