app/views/inscricao_liderancas/_form_correcao.html.erb

        <td>
          <%= form.collection_select :formacao_academica_04_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>
---
SELECT "resposta".* FROM "resposta"