app/views/inscricao_liderancas/index.html.erb

SELECT "cargos".* FROM "cargos" WHERE "cargos"."deleted_at" IS NULL
---
      <%= f.label "Cargo" %>
      <%= f.collection_select :cargo_id, Cargo.all, :id, :descricao, {include_blank: '--selecione--', selected: @cargo_id}, class: 'form-control' %>