app/views/inscricao_liderancas/show.html.erb

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "eccbc87e4b5ce2fe28308fd9f2a7baf3_Leticia_Simoes_Rivelini_"], ["LIMIT", 1]]
---
<% if(!params[:id].nil?) %>
  <% inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id]) %>

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <% if !@inscricao_lideranca.usuario_corrigiu_dados.nil? %>
          <% usuario = Usuario.find(@inscricao_lideranca.usuario_corrigiu_dados) %>