app/views/inscricao_servidors/_form.html.erb

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
<%= form_with(model: inscricao_servidor, local: true, html: { multipart: true }) do |form| %>
  <% configuracao = Configuracao.where(status: true).last %>

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "c4ca4238a0b923820dcc509a6f75849b_Eduardo_Filgueira"], ["LIMIT", 1]]
---
  <% if(!params[:id].nil?) %>
    <% inscricao_servidor = InscricaoServidor.find_by(slug: params[:id]) %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
    <br>
    <% configuracao = Configuracao.where(status: true).last %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
              <!--ABRIR RECURSO DA CONFERÊNCIA DOS DADOS-->
              <% configuracao = Configuracao.where(status: true).last %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
            <!--ABRIR RECURSO DA CONFERÊNCIA DOS DADOS-->
            <% configuracao = Configuracao.where(status: true).last %>

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
            <!-- ABRIR RECURSO DA PONTUAÇÃO -->
            <% configuracao = Configuracao.where(status: true).last %>