app/views/inscricao_servidors/_form_correcao.html.erb

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["LIMIT", 1]]
---
  <% if(!params[:id].nil?) %>
    <% inscricao_servidor = InscricaoServidor.find_by(slug: params[:id]) %>

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <% if !@inscricao_servidor.usuario_corrigiu_pontuacao.nil? %>
    <% usuario = Usuario.find(@inscricao_servidor.usuario_corrigiu_pontuacao) %>

SELECT "cargos".* FROM "cargos" WHERE "cargos"."deleted_at" IS NULL
---
      <%= form.label :cargo_id, class: 'required' %>
      <%= form.collection_select :cargo_id, Cargo.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', disabled: true %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_01_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_02_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_03_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_04_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_05_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_06_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :formacao_academica_07_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :qualificacao_profissional_01_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :qualificacao_profissional_02_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :qualificacao_profissional_03_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :qualificacao_profissional_04_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_01_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_02_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_03_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_04_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>

SELECT "resposta".* FROM "resposta"
---
        <td>
          <%= form.collection_select :experiencia_profissional_05_resposta, Resposta.all, :id, :descricao, {include_blank: '--selecione--'}, class: 'form-control', onchange: "ligar_desligar_campo_obs();validar_check(this);" %>