app/views/inscricao_servidors/index.pdf.erb

SELECT inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo, inscricao_servidors.total_geral_correcao FROM "inscricao_servidors" LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id WHERE "inscricao_servidors"."deleted_at" IS NULL AND (finalizar = true and inscricao_servidors.cargo_id = 4 and inscricao_servidors.status_acompanhamento = 'Correção de pontuação') ORDER BY total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc
SELECT inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo, inscricao_servidors.total_geral_correcao FROM "inscricao_servidors" LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id WHERE "inscricao_servidors"."deleted_at" IS NULL AND (finalizar = true and inscricao_servidors.cargo_id = 1) ORDER BY nome_completo
---
<% if @status_acompanhamento == "curriculo_analisado" or @status_acompanhamento == "resultado_final"  %>
  <% @inscricao_servidors = InscricaoServidor.select("inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo, inscricao_servidors.total_geral_correcao").joins("LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id").where("finalizar = true" + sql).order("total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc") %>
<% else %>
  <% @inscricao_servidors = InscricaoServidor.select("inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo, inscricao_servidors.total_geral_correcao").joins("LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id").where("finalizar = true" + sql).order("nome_completo") %>