app/views/inscricao_servidors/index.html.erb

      <%= f.label "Cargo" %>
      <%= f.collection_select :cargo_id, Cargo.all, :id, :descricao, {include_blank: '--selecione--', selected: @cargo_id}, class: 'form-control' %>
---
SELECT "cargos".* FROM "cargos" WHERE "cargos"."deleted_at" IS NULL