app/views/inscricao_servidors/show.html.erb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% if !@inscricao_servidor.usuario_corrigiu_dados.nil? %>
  <% usuario = Usuario.find(@inscricao_servidor.usuario_corrigiu_dados) %>