app/controllers/configuracaos_controller.rb

SELECT "configuracaos".* FROM "configuracaos"
---
  def index
    @configuracaos = Configuracao.all

UPDATE "configuracaos" SET "data_inicio_entrevista_lideranca" = $1, "data_termino_entrevista_lideranca" = $2, "updated_at" = $3 WHERE "configuracaos"."id" = $4  [["data_inicio_entrevista_lideranca", "2021-08-25"], ["data_termino_entrevista_lideranca", "2021-08-28"], ["updated_at", "2021-08-24 17:01:24.839083"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @configuracao.update(configuracao_params)

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_configuracao
      @configuracao = Configuracao.find(params[:id])