app/controllers/inscricao_servidors_controller.rb

SELECT inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo, inscricao_servidors.total_geral_correcao FROM "inscricao_servidors" LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id WHERE "inscricao_servidors"."deleted_at" IS NULL AND (finalizar = true and inscricao_servidors.cargo_id = 4 and inscricao_servidors.status_acompanhamento = 'Correção de pontuação') ORDER BY total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc
---
  def index
    @inscricao_servidors = InscricaoServidor.select("inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo").joins(
      "INNER JOIN cargos c ON c.id = inscricao_servidors.cargo_id")
      .where("finalizar = true")
      .order("total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc")

SELECT inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo FROM "inscricao_servidors" LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id WHERE "inscricao_servidors"."deleted_at" IS NULL AND (finalizar = true and cargo_id = 4 and inscricao_servidors.status_acompanhamento = 'Correção de pontuação') ORDER BY total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc
---

    end

    @inscricao_servidors = InscricaoServidor.select("inscricao_servidors.id serv_id, inscricao_servidors.*, c.descricao nome_cargo").joins(
      "LEFT JOIN cargos c ON c.id = inscricao_servidors.cargo_id")
      .where("finalizar = true" + sql)
      .order("total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc")

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["LIMIT", 1]]
---
  def show
    @inscricao_servidor = InscricaoServidor.find_by(slug: params[:id])

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
  def new
    unless usuario_signed_in?
      configuracao = Configuracao.where(status: true).last

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "c4ca4238a0b923820dcc509a6f75849b_Eduardo_Filgueira"], ["LIMIT", 1]]
---
  def edit
    unless usuario_signed_in?
      configuracao = Configuracao.where(status: true).last
      if configuracao.nil?
        render partial: 'notificar_ausencia_data'
      end
    end
    @inscricao_servidor = InscricaoServidor.find_by(slug: params[:id])

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["LIMIT", 1]]
---
  def edit_correcao
    @inscricao_servidor = InscricaoServidor.find_by(slug: params[:id])

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
  def cpf
    unless usuario_signed_in?
      configuracao = Configuracao.where(status: true).last

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["LIMIT", 1]]
UPDATE "inscricao_servidors" SET "finalizar" = $1, "status_acompanhamento" = $2, "updated_at" = $3 WHERE "inscricao_servidors"."id" = $4  [["finalizar", true], ["status_acompanhamento", "Finalizado"], ["updated_at", "2021-07-16 13:26:55.337126"], ["id", 28]]
---
  def finalizar
    inscricao_servidor = InscricaoServidor.find_by(slug: params[:id])
    inscricao_servidor.finalizar = true
    inscricao_servidor.status_acompanhamento = "Finalizado"
    inscricao_servidor.save

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["LIMIT", 1]]
---
  def analisar_dados_obs
    inscricao_servidor = InscricaoServidor.find_by(slug: params[:id])

UPDATE "inscricao_servidors" SET "resposta_recurso_candidato" = $1, "reclassificar_recurso_candidato" = $2, "status_acompanhamento" = $3, "updated_at" = $4 WHERE "inscricao_servidors"."id" = $5  [["resposta_recurso_candidato", "ok"], ["reclassificar_recurso_candidato", true], ["status_acompanhamento", "Correção de dados"], ["updated_at", "2021-07-16 13:45:08.067614"], ["id", 28]]
---
      inscricao_servidor.reclassificar_recurso_pontuacao = false
    end
    inscricao_servidor.usuario_corrigiu_dados = current_usuario[:id]
    inscricao_servidor.save

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1 LIMIT $2  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["LIMIT", 1]]
UPDATE "inscricao_servidors" SET "status_acompanhamento" = $1, "usuario_corrigiu_pontuacao" = $2, "updated_at" = $3 WHERE "inscricao_servidors"."id" = $4  [["status_acompanhamento", "Correção de pontuação"], ["usuario_corrigiu_pontuacao", 1], ["updated_at", "2021-07-16 13:45:27.745734"], ["id", 28]]
---
  def correcao(slug)
    inscricao_servidor = InscricaoServidor.find_by(slug: slug)
    inscricao_servidor.status_acompanhamento = "Correção de pontuação"
    inscricao_servidor.usuario_corrigiu_pontuacao = current_usuario[:id]
    inscricao_servidor.save

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "inscricao_servidors" SET "slug" = $1, "updated_at" = $2 WHERE "inscricao_servidors"."id" = $3  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"], ["updated_at", "2021-07-16 13:26:33.231893"], ["id", 28]]
---
  def create
    @inscricao_servidor = InscricaoServidor.new(inscricao_servidor_params)
    respond_to do |format|
      if @inscricao_servidor.save
        id_crypto = Digest::MD5.hexdigest(@inscricao_servidor.id.to_s)
        slug = "#{id_crypto}_" + remover_acentos(@inscricao_servidor.nome_completo)
        slug = slug.strip
        nome_completo = @inscricao_servidor.nome_completo.strip
        InscricaoServidor.find(@inscricao_servidor.id).update_attributes(nome_completo: nome_completo, slug: slug)

SELECT "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1  [["slug", "33e75ff09dd601bbe69f351039152189_Teste_do_lado_do_nonato"]]
UPDATE "inscricao_servidors" SET "certificado_ensino_medio" = $1, "deficiente_anexo" = $2, "formacao_academica_soma_correcao" = $3, "qualificacao_profissional_soma_correcao" = $4, "experiencia_profissional_soma_correcao" = $5, "formacao_academica_01_verificar" = $6, "formacao_academica_02_verificar" = $7, "formacao_academica_03_verificar" = $8, "formacao_academica_04_verificar" = $9, "formacao_academica_05_verificar" = $10, "formacao_academica_06_verificar" = $11, "formacao_academica_07_verificar" = $12, "qualificacao_profissional_01_verificar" = $13, "qualificacao_profissional_02_verificar" = $14, "qualificacao_profissional_03_verificar" = $15, "qualificacao_profissional_04_verificar" = $16, "experiencia_profissional_01_verificar" = $17, "experiencia_profissional_02_verificar" = $18, "experiencia_profissional_03_verificar" = $19, "experiencia_profissional_04_verificar" = $20, "experiencia_profissional_05_verificar" = $21, "total_geral_correcao" = $22, "updated_at" = $23 WHERE "inscricao_servidors"."id" = $24
---
  def update
    @inscricao_servidor = InscricaoServidor.where(slug: inscricao_servidor_params[:slug])[0]

    # DELETA O ARQUIVO AO MUDAR O CARGO PARA GARANTIR APENAS UM CERTIFICADO DE ENSINO
    if @inscricao_servidor.cargo_id == 4
      @inscricao_servidor.remove_certificado_ensino_superior!
    elsif
      @inscricao_servidor.remove_certificado_ensino_medio!
    end
    respond_to do |format|
      inscricao_servidor = inscricao_servidor_params
      id_crypto = Digest::MD5.hexdigest(@inscricao_servidor.id.to_s)
      slug = "#{id_crypto}_" + remover_acentos(@inscricao_servidor.nome_completo)
      slug = slug.strip
      inscricao_servidor[:slug] = slug
      inscricao_servidor[:nome_completo] = @inscricao_servidor.nome_completo.strip
      if inscricao_servidor_params[:recurso_candidato].blank?
        inscricao_servidor.delete("recurso_candidato")
      end
      if inscricao_servidor_params[:recurso_pontuacao].blank?
        inscricao_servidor.delete("recurso_pontuacao")
      end
      if inscricao_servidor_params[:deficiente] != "1"
        @inscricao_servidor.remove_deficiente_anexo!
      end

      if @inscricao_servidor.update(inscricao_servidor)

SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."cpf" = $1 AND "inscricao_servidors"."ativo" = $2 ORDER BY "inscricao_servidors"."id" DESC LIMIT $3  [["cpf", "047.780.244-35"], ["ativo", true], ["LIMIT", 1]]
SELECT  "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND (cpf = '047.780.244-35' and (id = 1 or data_nascimento = '1982-12-19') and ativo = true) ORDER BY "inscricao_servidors"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def buscar_por_cpf
    cpf = params[:frm][:cpf].nil? ? "" : params[:frm][:cpf]
    inscricao = params[:frm][:inscricao].nil? ? "" : params[:frm][:inscricao]
    tipo = params[:tipo].nil? ? "" : params[:tipo]
    data_nascimento = params[:frm][:data_nascimento].nil? ? "" : params[:frm][:data_nascimento]
    if verify_rucaptcha?
      if params[:tipo] == "novo"
        inscricao_servidor = InscricaoServidor.where(cpf: cpf, ativo: true).last
        if(inscricao_servidor.nil?)
          redirect_to new_inscricao_servidor_url(cpf: cpf)
        elsif(!inscricao_servidor.finalizar)
          redirect_to edit_inscricao_servidor_url(inscricao_servidor.slug)
        elsif(inscricao_servidor.finalizar)
          redirect_to "/?alert=Já existe CPF com esta inscrição. Favor selecione a opção consultar."
        end
      else
        data_nascimento = "1111-11-11"
        if(!params[:frm][:data_nascimento].blank?)
          data_nascimento = DateTime.parse(params[:frm][:data_nascimento]).strftime('%Y-%m-%d')
        end
        inscricao = inscricao.blank? ? "0" : inscricao
        inscricao_servidor = InscricaoServidor.where("cpf = '"+cpf.to_s+"' and (id = "+inscricao+" or data_nascimento = '"+data_nascimento+"') and ativo = true").last

SELECT "inscricao_servidors".* FROM "inscricao_servidors" WHERE "inscricao_servidors"."deleted_at" IS NULL AND "inscricao_servidors"."slug" = $1  [["slug", "c4ca4238a0b923820dcc509a6f75849b_Eduardo_Filgueira"]]
---
  def remover_file

    inscricao_servidor = InscricaoServidor.where(slug: params[:slug])[0]

UPDATE "inscricao_servidors" SET "formacao_academica_07_file" = $1, "formacao_academica_soma_candidato" = $2, "formacao_academica_07_candidato" = $3, "updated_at" = $4 WHERE "inscricao_servidors"."id" = $5  [["formacao_academica_07_file", nil], ["formacao_academica_soma_candidato", "16.0"], ["formacao_academica_07_candidato", "0.0"], ["updated_at", "2021-07-23 17:57:38.410439"], ["id", 1]]
---
    end

    if !params[:file].nil?
      inscricao_servidor.save