app/controllers/inscricao_liderancas_controller.rb

SELECT inscricao_liderancas.id serv_id, inscricao_liderancas.*, c.descricao nome_cargo FROM "inscricao_liderancas" INNER JOIN cargos c ON c.id = inscricao_liderancas.cargo_id WHERE "inscricao_liderancas"."deleted_at" IS NULL AND (finalizar = true) ORDER BY total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc, experiencia_profissional_04_correcao desc, experiencia_profissional_05_correcao desc
---
  def index
    @inscricao_liderancas = InscricaoLideranca.select("inscricao_liderancas.id serv_id, inscricao_liderancas.*, c.descricao nome_cargo").joins(
      "INNER JOIN cargos c ON c.id = inscricao_liderancas.cargo_id")
      .where("finalizar = true")
      .order("total_geral_correcao desc, experiencia_profissional_01_correcao desc, experiencia_profissional_02_correcao desc, experiencia_profissional_03_correcao desc")

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "5"], ["LIMIT", 1]]
---
  def show
    @inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "eccbc87e4b5ce2fe28308fd9f2a7baf3_Leticia_Simoes_Rivelini_"], ["LIMIT", 1]]
---
  def mostrar_lideranca
    @inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
---
  def new
    unless usuario_signed_in?
      configuracao = Configuracao.where(status: true).last

SELECT  "configuracaos".* FROM "configuracaos" WHERE "configuracaos"."status" = $1 ORDER BY "configuracaos"."id" DESC LIMIT $2  [["status", true], ["LIMIT", 1]]
SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "1679091c5a880faf6fb5e6087eb1b2dc_Leticia_Simoes_Rivelini"], ["LIMIT", 1]]
---
  def edit
    unless usuario_signed_in?
      configuracao = Configuracao.where(status: true).last
      if configuracao.nil?
        render partial: 'notificar_ausencia_data'
      end
    end
    @inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "1679091c5a880faf6fb5e6087eb1b2dc_Leticia_Simoes_Rivelini"], ["LIMIT", 1]]
---
  def edit_correcao
    @inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "1679091c5a880faf6fb5e6087eb1b2dc_Leticia_Simoes_Rivelini"], ["LIMIT", 1]]
UPDATE "inscricao_liderancas" SET "finalizar" = $1, "status_acompanhamento" = $2, "updated_at" = $3 WHERE "inscricao_liderancas"."id" = $4  [["finalizar", true], ["status_acompanhamento", "Finalizado"], ["updated_at", "2021-08-24 16:01:00.597991"], ["id", 6]]
---
  def finalizar
    inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])
    inscricao_lideranca.finalizar = true
    inscricao_lideranca.status_acompanhamento = "Finalizado"
    inscricao_lideranca.save

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "eccbc87e4b5ce2fe28308fd9f2a7baf3_Leticia_Simoes_Rivelini_"], ["LIMIT", 1]]
---
  def analisar_dados_obs
    inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])

INSERT INTO "inscricao_liderancas" ("cpf", "nome_completo", "naturalidade", "nacionalidade", "nome_mae", "sexo", "estado_civil", "data_nascimento", "rg", "orgao_emissor", "endereco", "complemento", "bairro", "cidade", "uf", "cep", "telefone_fixo", "telefone_celular", "email", "orgao_representacao_classe", "numero_registro", "termo_aceito", "represetacao_classe", "created_at", "updated_at", "cargo_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26) RETURNING "id"
UPDATE "inscricao_liderancas" SET "resposta_recurso_candidato_dados" = $1, "reclassificar_recurso_candidato_dados" = $2, "status_acompanhamento" = $3, "updated_at" = $4 WHERE "inscricao_liderancas"."id" = $5  [["resposta_recurso_candidato_dados", "ok"], ["reclassificar_recurso_candidato_dados", true], ["status_acompanhamento", "Correção de dados"], ["updated_at", "2021-08-24 18:23:46.999094"], ["id", 3]]
---
      inscricao_lideranca.reclassificar_recurso_entrevista = false
    end
    inscricao_lideranca.usuario_corrigiu_dados = current_usuario[:id]
    inscricao_lideranca.save

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "eccbc87e4b5ce2fe28308fd9f2a7baf3_Leticia_Simoes_Rivelini_"], ["LIMIT", 1]]
UPDATE "inscricao_liderancas" SET "status_acompanhamento" = $1, "usuario_corrigiu_entrevista" = $2, "updated_at" = $3 WHERE "inscricao_liderancas"."id" = $4  [["status_acompanhamento", "Correção de pontuação"], ["usuario_corrigiu_entrevista", 1], ["updated_at", "2021-08-24 16:02:07.521921"], ["id", 6]]
---
  def correcao(slug)
    inscricao_lideranca = InscricaoLideranca.find_by(slug: slug)
    inscricao_lideranca.status_acompanhamento = "Correção de pontuação"
    inscricao_lideranca.usuario_corrigiu_entrevista = current_usuario[:id]
    inscricao_lideranca.save

INSERT INTO "inscricao_liderancas" ("cpf", "nome_completo", "naturalidade", "nacionalidade", "nome_mae", "sexo", "estado_civil", "data_nascimento", "rg", "orgao_emissor", "endereco", "complemento", "bairro", "cidade", "uf", "cep", "telefone_fixo", "telefone_celular", "email", "orgao_representacao_classe", "numero_registro", "termo_aceito", "documentos", "created_at", "updated_at", "cargo_id", "certificado_ensino_superior", "formacao_academica_01_candidato", "formacao_academica_01_correcao", "formacao_academica_02_candidato", "formacao_academica_02_correcao", "formacao_academica_03_candidato", "formacao_academica_03_correcao", "formacao_academica_04_candidato", "formacao_academica_04_correcao", "formacao_academica_05_candidato", "formacao_academica_05_correcao", "experiencia_profissional_01_candidato", "experiencia_profissional_01_correcao", "experiencia_profissional_02_candidato", "experiencia_profissional_02_correcao", "experiencia_profissional_03_candidato", "experiencia_profissional_03_correcao", "experiencia_profissional_01_file", "formacao_academica_total", "experiencia_profissional_total", "formacao_academica_soma_candidato", "experiencia_profissional_soma_candidato", "total_geral_candidato") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49) RETURNING "id"
SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "inscricao_liderancas" SET "slug" = $1, "updated_at" = $2 WHERE "inscricao_liderancas"."id" = $3  [["slug", "1679091c5a880faf6fb5e6087eb1b2dc_Leticia_Simoes_Rivelini"], ["updated_at", "2021-08-24 15:59:16.862798"], ["id", 6]]
---
  def create
    @inscricao_lideranca = InscricaoLideranca.new(inscricao_lideranca_params)
    respond_to do |format|
      if @inscricao_lideranca.save
        id_crypto = Digest::MD5.hexdigest(@inscricao_lideranca.id.to_s)
        slug = "#{id_crypto}_" + remover_acentos(@inscricao_lideranca.nome_completo)
        slug = slug.strip
        nome_completo = @inscricao_lideranca.nome_completo.strip
        InscricaoLideranca.find(@inscricao_lideranca.id).update_attributes(nome_completo: nome_completo, slug: slug)

SELECT "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1  [["slug", "eccbc87e4b5ce2fe28308fd9f2a7baf3_Leticia_Simoes_Rivelini_"]]
UPDATE "inscricao_liderancas" SET "experiencia_profissional_01_correcao" = $1, "formacao_academica_soma_correcao" = $2, "experiencia_profissional_soma_correcao" = $3, "formacao_academica_01_verificar" = $4, "formacao_academica_02_verificar" = $5, "formacao_academica_03_verificar" = $6, "formacao_academica_04_verificar" = $7, "formacao_academica_05_verificar" = $8, "experiencia_profissional_01_verificar" = $9, "experiencia_profissional_02_verificar" = $10, "experiencia_profissional_03_verificar" = $11, "formacao_academica_01_resposta" = $12, "formacao_academica_02_resposta" = $13, "formacao_academica_03_resposta" = $14, "formacao_academica_04_resposta" = $15, "formacao_academica_05_resposta" = $16, "experiencia_profissional_01_resposta" = $17, "experiencia_profissional_02_resposta" = $18, "experiencia_profissional_03_resposta" = $19, "total_geral_correcao" = $20, "updated_at" = $21 WHERE "inscricao_liderancas"."id" = $22
---
  def update
    @inscricao_lideranca = InscricaoLideranca.where(slug: inscricao_lideranca_params[:slug])[0]

    respond_to do |format|
      inscricao_lideranca = inscricao_lideranca_params
      id_crypto = Digest::MD5.hexdigest(@inscricao_lideranca.id.to_s)
      slug = "#{id_crypto}_" + remover_acentos(@inscricao_lideranca.nome_completo)
      slug = slug.strip
      inscricao_lideranca[:slug] = slug
      inscricao_lideranca[:nome_completo] = @inscricao_lideranca.nome_completo.strip

      # if inscricao_lideranca_params[:recurso_candidato].blank?
      #   inscricao_lideranca.delete("recurso_candidato")
      # end
      # if inscricao_lideranca_params[:recurso_pontuacao].blank?
      #   inscricao_lideranca.delete("recurso_pontuacao")
      # end
      # if inscricao_lideranca_params[:deficiente] != "1"
      #   @inscricao_lideranca.remove_deficiente_anexo!
      # end

      if @inscricao_lideranca.update(inscricao_lideranca)

SELECT  "regiaos".* FROM "regiaos" WHERE "regiaos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "regiaos" WHERE "regiaos"."id" = $1  [["id", 1]]
---
  def deletar_regiao
    regiao = Regiao.find(params[:id])
    inscricao_lideranca = InscricaoLideranca.find(regiao.inscricao_lideranca_id)
    # raise inscricao_lideranca.slug.inspect
    if regiao.destroy

SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "3"], ["LIMIT", 1]]
---
    def set_inscricao_lideranca
      @inscricao_lideranca = InscricaoLideranca.find_by(slug: params[:id])