app/controllers/inscricao_liderancas_controller.rb

  def remover_file

    inscricao_lideranca = InscricaoLideranca.where(slug: params[:slug])[0]
---
SELECT  "inscricao_liderancas".* FROM "inscricao_liderancas" WHERE "inscricao_liderancas"."deleted_at" IS NULL AND "inscricao_liderancas"."slug" = $1 LIMIT $2  [["slug", "c81e728d9d4c2f636f067f89cc14862c_teste"], ["LIMIT", 1]]