app/controllers/local_contratacaos_controller.rb

SELECT "local_contratacaos".* FROM "local_contratacaos"
---
  def index
    @local_contratacaos = LocalContratacao.all

INSERT INTO "local_contratacaos" ("descricao", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descricao", "Fortaleza"], ["created_at", "2021-08-20 18:08:25.593715"], ["updated_at", "2021-08-20 18:08:25.593715"]]
---
  def create
    @local_contratacao = LocalContratacao.new(local_contratacao_params)

    respond_to do |format|
      if @local_contratacao.save

SELECT  "local_contratacaos".* FROM "local_contratacaos" WHERE "local_contratacaos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_local_contratacao
      @local_contratacao = LocalContratacao.find(params[:id])