app/controllers/regiaos_controller.rb

SELECT "regiaos".* FROM "regiaos"
---
  def index
    @regiaos = Regiao.all