app/models/inscricao_servidor.rb

  def formacao_academica_05_resposta_descricao
    self.formacao_academica_05_resposta.blank? ? "" : Resposta.find(self.formacao_academica_05_resposta).descricao
---
SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def qualificacao_profissional_01_resposta_descricao
    self.qualificacao_profissional_01_resposta.blank? ? "" : Resposta.find(self.qualificacao_profissional_01_resposta).descricao
---
SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def experiencia_profissional_01_resposta_descricao
    self.experiencia_profissional_01_resposta.blank? ? "" : Resposta.find(self.experiencia_profissional_01_resposta).descricao
---
SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def experiencia_profissional_03_resposta_descricao
    self.experiencia_profissional_03_resposta.blank? ? "" : Resposta.find(self.experiencia_profissional_03_resposta).descricao
---
SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def experiencia_profissional_04_resposta_descricao
    self.experiencia_profissional_04_resposta.blank? ? "" : Resposta.find(self.experiencia_profissional_04_resposta).descricao
---
SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]