app/models/inscricao_lideranca.rb

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def formacao_academica_01_resposta_descricao
    self.formacao_academica_01_resposta.blank? ? "" : Resposta.find(self.formacao_academica_01_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def formacao_academica_02_resposta_descricao
    self.formacao_academica_02_resposta.blank? ? "" : Resposta.find(self.formacao_academica_02_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def formacao_academica_03_resposta_descricao
    self.formacao_academica_03_resposta.blank? ? "" : Resposta.find(self.formacao_academica_03_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def formacao_academica_04_resposta_descricao
    self.formacao_academica_04_resposta.blank? ? "" : Resposta.find(self.formacao_academica_04_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def formacao_academica_05_resposta_descricao
    self.formacao_academica_05_resposta.blank? ? "" : Resposta.find(self.formacao_academica_05_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def experiencia_profissional_01_resposta_descricao
    self.experiencia_profissional_01_resposta.blank? ? "" : Resposta.find(self.experiencia_profissional_01_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def experiencia_profissional_02_resposta_descricao
    self.experiencia_profissional_02_resposta.blank? ? "" : Resposta.find(self.experiencia_profissional_02_resposta).descricao

SELECT  "resposta".* FROM "resposta" WHERE "resposta"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def experiencia_profissional_03_resposta_descricao
    self.experiencia_profissional_03_resposta.blank? ? "" : Resposta.find(self.experiencia_profissional_03_resposta).descricao